[
  {
    "document_id": "1f982816dd44401badb26a79b2bb3088",
    "file_name": "random_news.wav",
    "chunk_id": "1f982816dd44401badb26a79b2bb3088_1",
    "chunk_type": "audio",
    "text": "This is V.O.A. News. We are remote. I'm Marissa Melton. The U.S. on Thursday imposed new economic sanctions on a number of Russians, including some that it accused of stealing Ukrainian grain. The U.S. State Department said the sanctioned individuals also include an official who allegedly directed the deportation of tens of thousands of Ukrainian children to Russia, as well as relatives of Chechen leader Ramzan Kadeirov. U.S. Secretary of State Antony Blinken said the United States continues to hold the Russian government to account for its war against Ukraine in Kiev, Ukrainian President Vladimir Zelensky hosted European Commission President Ursula Vunderlayev for talks that she said would include quote, getting our economies and people closer while Ukraine progresses toward membership in the European Union. Ukraine applied to join the EU in late February, days after Russia launched its invasion. The EU granted Ukraine candidacy status in June. Ukraine's president says a mass burial site has been found in territory reclaimed this week from Russian forces, a P.C. correspondent Ben Thomas has warned. In his nightly address, President Vladimir Zelensky says the mass grave was found in Isium in the Harkiv region. He says the process has begun to document the site and produce clear, verifiable information. It's in a forest outside the city and associated press journalists at the site say the grave bore a marker, saying it contained the bodies of 17 Ukrainian soldiers. It was surrounded by hundreds of individual graves, but only crosses to mark them. In his remarks, Zelensky said Russia leads death everywhere and it must be held accountable for it. I'm Ben Thomas. Tens of thousands of mourners lined up through the night and into the day, Thursday in London, to file past the coffin of Queen Elizabeth, the second in Westminster Hall. This is VOA news. The Chinese Foreign Ministry said Thursday Beijing had lodged solemn representations with the United States after a major congressional committee approved a bill that would enhance US military support for Taiwan. The bill includes provisions for billions of dollars in additional security assistance for Taiwan as China increases military pressure on the self-ruled island. China considers Taiwan a breakaway province and its valduenex, the island by any means necessary, including military force. Dennis Great Roger Federer announced his retirement from the gang Thursday after a career which saw him win 20 grand slams, 100 re-career titles, and be crowned one of the greatest players of all time. The 41-year-old",
    "token_count": 512,
    "file_type": "audio/wav",
    "source_url": "s3://e2e-rag-system-42/data/raw/audio/random_news.wav",
    "audio_range": "[\"00:00:00.562\", \"00:02:56.709\"]",
    "timestamp": "2025-09-26T12:27:26Z",
    "parser_version": "faster-whisper-v1",
    "tags": [],
    "layout_tags": "[]",
    "used_ocr": false,
    "heading_path": "[]",
    "headings": "[]"
  }
,
  {
    "document_id": "1f982816dd44401badb26a79b2bb3088",
    "file_name": "random_news.wav",
    "chunk_id": "1f982816dd44401badb26a79b2bb3088_2",
    "chunk_type": "audio",
    "text": "force. Dennis Great Roger Federer announced his retirement from the gang Thursday after a career which saw him win 20 grand slams, 100 re-career titles, and be crowned one of the greatest players of all time. The 41-year-old said he would retire after the labor cup in London later in September. He hasn't laid since Wimbledon in 2021 because of a knee problem. The Mexican government says an army general has been detained in connection with the disappearance of 43 students in 2014. It's the latest arrest in a case that generated international condemnation. The Deputy Secretary of Security Minister Toll reporters Thursday that the general commended a battalion in the area of southern Mexico where the incident occurred, he's one of three suspects detained. The Deputy Security Minister did not identify the suspects, but said the other two were also military personnel. Prosecutors announced last month that arrest warrants had been issued for more than 80 suspects in the case, including 20 military personnel, 44 police officers, and 14 cartel members. The case is one of the worst human rights tragedies in Mexico where a spiral of drug-related violence has left more than 100,000 people missing. The United States Congress is moving ahead on bipartisan action, strengthening trade and defense ties with Taiwan as the self-governing island faces new threats from China. The U.S. Senate Foreign Relations Committee approved the Taiwan Policy Act on Wednesday, clearing the way for $6.5 billion in enhanced security funding over five years to come up for a full vote on the Senate floor. The measure would also designate Taiwan as a major non-NATO ally. Senate Foreign Relations Committee Chairman Bob Nendez said after the committee approved the bill that the measure aims to raise the cost of taking the island by force, which China has threatened to do. President Biden approved $1.1 billion in arms sales to Taiwan earlier this month. China condemned that move. And once again, the U.S. on Thursday imposed new economic sanctions on a number of Russians, including some, it accuses of stealing Ukrainian grain. Marisa Melton, V.O.",
    "token_count": 427,
    "file_type": "audio/wav",
    "source_url": "s3://e2e-rag-system-42/data/raw/audio/random_news.wav",
    "audio_range": "[\"00:02:41.650\", \"00:04:58.835\"]",
    "timestamp": "2025-09-26T12:27:26Z",
    "parser_version": "faster-whisper-v1",
    "tags": [],
    "layout_tags": "[]",
    "used_ocr": false,
    "heading_path": "[]",
    "headings": "[]"
  }
]
